[Killed] BlockStatement
src/App.tsx:1:16
-function App() {
-  return (
-    <div>
-      <h1>Hello there</h1>
-      <p>This is a basic component</p>
-    </div>
-  );
-}
+function App() {}
 
 export default App;
killedBy: App renders without crashing
statusReason: TestingLibraryElementError: Unable to find an element with the text: Hello there. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
